app/views/carts/index.html.haml

    .row
      - current_user.products.each do |product|
        .col-sm-12
---
SELECT `products`.* FROM `products` INNER JOIN `carts` ON `products`.`id` = `carts`.`product_id` WHERE `carts`.`user_id` = 1