app/controllers/home_controller.rb

SELECT `stores`.* FROM `stores`
---
  def index
    @stores = Store.all