app/controllers/home_controller.rb

SELECT `stores`.* FROM `stores`
SELECT `products`.* FROM `products`
---
  def admin
    @stores = Store.all
    @products = Product.all