app/controllers/products_controller.rb

  def create
    @product = @store.products.new product_params
    if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `name`, `price`, `updated_at`) VALUES ('2014-04-23 19:09:14', 'A pretty lady in a dress', 'Dressydress', 'moderately expensive', '2014-04-23 19:09:14')

  def add_to_cart
    current_user.carts.create({product_id: params[:id]})
---
INSERT INTO `carts` (`created_at`, `product_id`, `updated_at`, `user_id`) VALUES ('2014-04-25 17:30:29', 1, '2014-04-25 17:30:29', 1)

  def find_store
    @store = Store.find params[:store_id]
---
SELECT  `stores`.* FROM `stores`  WHERE `stores`.`id` = 1 LIMIT 1

    def find_product
      @product = @store.products.find params[:id]
---
SELECT  `products`.* FROM `products`  WHERE `products`.`store_id` = 1 AND `products`.`id` = 1 LIMIT 1