app/controllers/stores_controller.rb

  def index
    @stores = Store.all
---
SELECT `stores`.* FROM `stores`

  def show
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO `stores` (`created_at`, `location`, `name`, `updated_at`) VALUES ('2014-04-22 19:59:58', 'Mt Pleasant, SC', 'Genealogy', '2014-04-22 19:59:58')

  def destroy
    @store.destroy
---
DELETE FROM `stores` WHERE `stores`.`id` = 2

    def set_store
      @store = Store.find(params[:id])
---
SELECT  `stores`.* FROM `stores`  WHERE `stores`.`id` = 2 LIMIT 1